In [11]:
import pandas as pd

In [12]:
info = {
    "name":["abhishek","ahmed","layla","abu saed","waheed"],
    "cgpa":[7.6,8.1,7.1,7.0,9],
    "country":["India","Turkiye","Tunisia","Saudi Arabia","Syria"],
    "university":"Lovely Professional University"
}
pd2 = pd.DataFrame(info)
print(pd2)

       name  cgpa       country                      university
0  abhishek   7.6         India  Lovely Professional University
1     ahmed   8.1       Turkiye  Lovely Professional University
2     layla   7.1       Tunisia  Lovely Professional University
3  abu saed   7.0  Saudi Arabia  Lovely Professional University
4    waheed   9.0         Syria  Lovely Professional University

In [13]:
pd2

       name  cgpa       country                      university
0  abhishek   7.6         India  Lovely Professional University
1     ahmed   8.1       Turkiye  Lovely Professional University
2     layla   7.1       Tunisia  Lovely Professional University
3  abu saed   7.0  Saudi Arabia  Lovely Professional University
4    waheed   9.0         Syria  Lovely Professional University

In [22]:
#series in pandas 
s= pd.Series([1,30,40,-2])

#indexing 
print(s[2])
print(s)
lab_series = pd.Series([45,23,25,20],index=["Adam","Eve","Lahm","lamine"])
print(f"Adam is {lab_series["Adam"]} years old")
print(f"The first index goes to {lab_series[0]}")
print(lab_series)

40
0     1
1    30
2    40
3    -2
dtype: int64
Adam is 45 years old
The first index goes to 45
Adam      45
Eve       23
Lahm      25
lamine    20
dtype: int64

C:\Users\Abhishek Kumar Singh\AppData\Local\Temp\ipykernel_31752\2390152195.py:9: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f"The first index goes to {lab_series[0]}")

In [30]:
#proeprties of series 
 # -> thy are homogenous 
s1 = pd.Series([3,2,1,6,3],index = ["adam","messi","luis",5,8])
print(s1.index.dtype) # aisa pta karte hai index ka dtype

#they have mutable values 
s3 = pd.Series([10, 20, 30])
s3[0] = 100
print(s3)

#they have immutable size 
s4 = pd.Series([10,20])
s4[2]= 60;
s4.drop(0)
print(s4)

object
0    100
1     20
2     30
dtype: int64
0    10
1    20
2    60
dtype: int64

In [ ]:
#data frames